# parameters
nc: 6  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [107,97,  119,110,  126,119]  # P3/8
  - [137,121,  134,131,  146,134]  # P4/16
  - [143,145,  154,148,  162,163]  # P5/32
# 107,97,  119,110,  126,119,  137,121,  134,131,  146,134,  143,145,  154,148,  162,163 a_t=2
# 120,111,  136,130,  151,150 a_t=2
# YOLOv5 backbone
backbone:
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4

   [-1, 3, GhostBottleneck, [128, 3, 1]],
   [-1, 1, GhostBottleneck, [256, 3, 2]],  # 3-P3/8
   [-1, 9, GCBAM, [256, 3, 1]],

   [-1, 1, GhostBottleneck, [512, 3, 2]],  # 5-P4/16
   [-1, 9, GCBAM, [512, 3, 1]],

   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, GCBAM, [1024, 3, 1]],  # 9
  ]
# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, DWConv, [512, 3, 1]],
   [-1, 3, GhostBottleneck, [512, 3, 1]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, DWConv, [256, 3, 1]],
   [-1, 3, GhostBottleneck, [256, 3, 1]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 1, DWConv, [512, 3, 1]],
   [-1, 3, GhostBottleneck, [512, 3, 1]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 1, DWConv, [1024, 3, 1]],
   [-1, 3, GhostBottleneck, [1024, 3, 1]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
